tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

brew "mas"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "romkatv/powerlevel10k/powerlevel10k"

brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "neofetch"
brew "nvim"
brew "ripgrep"
brew "tmux"
brew "zoxide"

brew "pyenv"
brew "pyenv-virtualenv"
brew "jawshooah/pyenv/pyenv-default-packages", args: ["HEAD"]

brew "prettier"
brew "shfmt"

cask "docker"
cask "kitty"
cask "google-chrome"
cask "rectangle"

cask "font-hack-nerd-font"

cask "logi-options-plus"
cask "kkbox"

mas "Microsoft OneNote", id: 784801555
mas "LINE", id: 539883307
