# Fast, scalable, distributed revision control system
# https://github.com/git/git
brew 'git'

# Move and resize windows on macOS with keyboard shortcuts and snap areas
# https://github.com/rxhanson/Rectangle
brew 'rectangle'

# These are the GNU core utilities.
# https://github.com/coreutils/coreutils
brew 'coreutils'

# A modern replacement for ls.
# https://the.exa.website/
brew 'exa'

# A line-oriented search tool that recursively searches the current directory for a regex pattern.
# https://github.com/BurntSushi/ripgrep
brew 'ripgrep'

# A command-line fuzzy finder
# https://github.com/junegunn/fzf
brew 'fzf'

# A cat(1) clone with wings.
# https://github.com/sharkdp/bat
brew 'bat'

# A shell parser, formatter, and interpreter with bash support
# https://github.com/mvdan/sh
brew 'shfmt'

# ShellCheck, a static analysis tool for shell scripts
# https://github.com/koalaman/shellcheck
brew 'shellcheck'

# Terminal multiplexer
# https://github.com/tmux/tmux
brew 'tmux'

# Manage complex tmux sessions easily
# https://github.com/tmuxinator/tmuxinator
brew 'tmuxinator'

# Vim is a greatly improved version of the good old UNIX editor Vi.
# https://github.com/vim/vim
brew 'vim'

# Vim-fork focused on extensibility and usability
# https://github.com/neovim/neovim
brew 'neovim'

# A command-line system information tool written in bash 3.2+
# https://github.com/dylanaraps/neofetch
brew 'neofetch'

# The LLVM Project is a collection of modular and reusable compiler and toolchain technologies.
# https://github.com/llvm/llvm-project
brew 'llvm'

# the cross-platform, open-source build system.
# https://gitlab.kitware.com/cmake/cmake
brew 'cmake'

# C/C++/ObjC language server supporting cross references, hierarchies, completion and semantic highlighting
# https://github.com/MaskRay/ccls
brew 'ccls'

# A cross-platform, OpenGL terminal emulator.
# https://github.com/alacritty/alacritty
cask 'alacritty'

# A configurable diagramming/whiteboarding visualization application.
# https://github.com/jgraph/drawio-desktop
cask 'drawio'
