tap "daipeihust/tap" # im-select

brew "mas"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "powerlevel10k"

brew "bat"
brew "coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "httpie"
brew "im-select"
brew "jq"
brew "neofetch"
brew "nvim"
brew "ripgrep"
brew "tmux"
brew "tmuxinator"
brew "zoxide"

brew "pyenv"
brew "pyenv-virtualenv"
brew "jawshooah/pyenv/pyenv-default-packages", args: ["HEAD"]

brew "prettier"
brew "shfmt"
brew "stylua"

# optional terminal emulator
# cask "alacritty"

cask "dbeaver-community"
cask "docker"
cask "drawio"
cask "kitty"
cask "rectangle"
cask "visual-studio-code"
cask "mactex"
cask "skim"

cask "font-hack-nerd-font"
